app/controllers/microsite_controller.rb

  def follow_the_tour
    @prospect = Prospect.new
    @wholesalers  = Wholesaler.event_upcoming.paginate :page => params[:page], :per_page => 15
---
SELECT * FROM "wholesalers" WHERE (event_date > '2011-03-16') ORDER BY event_date ASC LIMIT 15 OFFSET 0