app/controllers/task_dashboard_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."complete" = 'f') ORDER BY due_date ASC LIMIT 30 OFFSET 0
---
  def index
    @complete = params[:complete]
    if @complete
      @tasks = Task.complete.paginate :page => params[:page]